app/controllers/home_controller.rb

  def index
    type = params[:type]
    type = nil if params[:type] == 'o'
    @blogs = Blog.paginate :per_page => 10, :page => params[:page]||1,
      :conditions => ['blog_type like ?',type||"%" ],
      :order => 'created_at'
---
SELECT * FROM "blogs" WHERE (blog_type = 'a') ORDER BY created_at LIMIT 10 OFFSET 0