app/controllers/user_controller.rb

  def signup
    redirect_to :action=>"login" if !request.post?
    @user = User.new(params[:user])
     @user_login = User.new()
    if @user.save
---
INSERT INTO "users" ("updated_at", "login_name", "alias_name", "password", "email", "created_at") VALUES('2010-12-07 11:17:24', 'lee123', '无量天尊', '7c4a8d09ca3762af61e59520943dc26494f8941b', 'liwenjingabc@gmail.com', '2010-12-07 11:17:24')

  def forget_password
    user = User.find_by_email(params[:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'liwenjingabc@gmail.com') LIMIT 1